app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-04-08 10:28:07.663789"], ["updated_at", "2018-04-08 10:28:07.663789"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-04-08 10:28:07.691565"], ["updated_at", "2018-04-08 10:28:07.691565"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |row|
      Song.create(title: row[0], artist_name: row[1])